---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceCoverFaceCompletely
source: html/ea11a218-fac9-07ab-2187-d731ace99183.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceCoverFaceCompletely Property

"Cover face completely"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceCoverFaceCompletely { get; }
```